     H                                                                          
     FREPORT  O  F       80                   PRINTER                           
     C           Z-ADD       100NUM1       52                                
     C           Z-ADD        25NUM2       52                                
     C  NUM1     ADD       NUM2 SUM        52                                
     C  NUM1     SUB       NUM2 DIFF       52                                
     C  NUM1     MULT      NUM2 PROD       92                                
     C  NUM1     DIV       NUM2 QUOT       52                                
     C  NUM1     SQRT           SQROOT     52                                
     C  NUM1     ADD       0.555ROUND1     52   H                            
     C  NUM1     COMP      NUM2                  5152                           
     C51         SETON                                    10                    
     C52         SETON                                    20                    
     C           SETON                                    LR                    
     OREPORT  H   1P                                                            
     O                             40   'CALCULATION TEST'                      
     O        D   1                                                             
     O                             20    'SUM:'                                 
     O              SUM       1    40                                           
     O        D   1                                                             
     O                             20    'DIFF:'                                
     O              DIFF      1    40                                           
     O        D   1                                                             
     O                             20    'PROD:'                                
     O              PROD      1    40                                           
     O        D   1                                                             
     O                             20    'QUOT:'                                
     O              QUOT      1    40                                           
     O        D   1                                                             
     O                             20    'SQRT:'                                
     O              SQROOT    1    40                                           
     O        D   1                                                             
     O                             20    'ROUND:'                               
     O              ROUND1    1    40                                           
     O        D   1                                                             
     O 10                 40    'NUM1>NUM2'                                     
     O        D   1                                                             
     O 20                 40    'NUM1<NUM2'                                     
