     H                                                                          
     FREPORT   O   F 132        PRINTER                                       
     C           Z-ADD 100         NUM1     52                             
     C           Z-ADD 25          NUM2     52                             
     C           NUM1      ADD   NUM2      SUM      52                    
     C           NUM1      SUB   NUM2      DIFF     52                    
     C           NUM1      MULT  NUM2      PROD     92                    
     C           NUM1      DIV   NUM2      QUOT     52                    
     C           NUM1      SQRT            SQROOT   52                    
     C           NUM1      ADD   0.555     ROUND1  52H                   
     C           NUM1      COMP  NUM2             5152                   
     C  51                 SETON                       10                
     C  52                 SETON                       20                
     C                     SETON                     LR                    
     OREPORT   H    1P                                                         
     O                                       40 'CALCULATION TEST'              
     O          H    1P                                                         
     O                                       20 'OPERATION'                     
     O                                       50 'RESULT'                        
     O          D    1P                                                         
     O                                       20 'SUM:'                          
     O                    SUM          1    50                                 
     O          D    1P                                                         
     O                                       20 'DIFFERENCE:'                   
     O                    DIFF         1    50                                 
     O          D    1P                                                         
     O                                       20 'PRODUCT:'                      
     O                    PROD         1    50                                 
     O          D    1P                                                         
     O                                       20 'QUOTIENT:'                     
     O                    QUOT         1    50                                 
     O          D    1P                                                         
     O                                       20 'SQUARE ROOT:'                  
     O                    SQROOT       1    50                                 
     O          D    1P                                                         
     O                                       20 'ROUNDED:'                      
     O                    ROUND1       1    50                                 
     O          D    1P                                                         
     O  10                                   20 'NUM1 > NUM2'                   
     O          D    1P                                                         
     O  20                                   20 'NUM1 < NUM2'                   